# Ultralytics YOLO11 - No P2, CA only at backbone end + neck (index 15)
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10
  - [-1, 1, CoordAtt, [1024]]           # 11 ← ✅ 1x CA in backbone (final output)

head:
  # FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
  - [[-1, 6], 1, Concat, [1]]                     # 13 (cat P4 from backbone index 6)
  - [-1, 2, C3k2, [512, False]]                   # 14
  - [-1, 1, CoordAtt, [512]]                      # 15 ← ✅ 1x CA in head, exactly at neck #15

  # FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
  - [[-1, 4], 1, Concat, [1]]                     # 17 (cat P3 from backbone index 4)
  - [-1, 2, C3k2, [256, False]]                   # 18

  # PAN: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20 ← cat from CA-enhanced P4 (index 15)
  - [-1, 2, C3k2, [512, False]]                   # 21

  # PAN: P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 11], 1, Concat, [1]]                    # 23 ← cat from backbone CA output (index 11)
  - [-1, 2, C3k2, [1024, True]]                   # 24

  # Detect on P3, P4, P5 → NO P2
  - [[18, 21, 24], 1, Detect, [nc]]               # 25 ← P3(18), P4(21), P5(24)