# Ultralytics YOLO11 - No P2, CA only at backbone end + neck (fixed for scale='s')
nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0 → 64 * 0.5 = 32
  - [-1, 1, Conv, [128, 3, 2]]             # 1 → 128 * 0.5 = 64
  - [-1, 1, C3k2, [256, False, 0.25]]      # 2 → 256 * 0.5 = 128
  - [-1, 1, CoordAtt, [128, 128]]          # 3 ✅ input=128 → [128,128]
  - [-1, 1, Conv, [256, 3, 2]]             # 4 → 256 * 0.5 = 128
  - [-1, 1, C3k2, [512, False, 0.25]]      # 5 → 512 * 0.5 = 256
  - [-1, 1, Conv, [512, 3, 2]]             # 6 → 512 * 0.5 = 256
  - [-1, 1, C3k2, [512, False, 0.25]]      # 7 → 256
  - [-1, 1, Conv, [1024, 3, 2]]            # 8 → 1024 * 0.5 = 512
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 9 → 512
  - [-1, 1, SPPF, [1024, 5]]               # 10 → 512
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 11 → 512

head:
  # FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 → 512
  - [[-1, 7], 1, Concat, [1]]                    # 13 → 512 + 256 = 768
  - [-1, 1, C3k2, [512, False, 0.25]]            # 14 → 512 * 0.5 = 256
  - [-1, 1, CoordAtt, [256, 256]]                # 15 ✅ input=256 → [256,256]

  # FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16 → 256
  - [[-1, 5], 1, Concat, [1]]                    # 17 → 256 + 256 = 512
  - [-1, 1, C3k2, [256, False, 0.25]]            # 18 → 256 * 0.5 = 128

  # PAN: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 19 → 128 → 256
  - [[-1, 15], 1, Concat, [1]]                   # 20 → 256 + 256 = 512
  - [-1, 1, C3k2, [512, False, 0.25]]            # 21 → 256

  # PAN: P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 22 → 256 → 512
  - [[-1, 11], 1, Concat, [1]]                   # 23 → 512 + 512 = 1024
  - [-1, 1, C3k2, [1024, False, 0.25]]           # 24 → 512

  # Detect on P3, P4, P5 → NO P2
  - [[18, 21, 24], 1, Detect, [nc]]              # 25 ← P3(128), P4(256), P5(512)