# Ultralytics YOLO11n with Coordinate Attention + P2 Head
# ✅ Guaranteed to use scale='n' if filename = yolo11n-ca-p2.yaml
# ✅ Params ≈ 3.0M, not 26M

nc: 80

# Jangan ubah blok scales — hanya untuk referensi
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10
  - [-1, 1, CoordAtt, []]                  # 11

head:
  # FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, CoordAtt, []]                  # 14

  # FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]            # 17

  # 🔸 P2 Path (High-Res)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [[-1, 1], 1, Concat, [1]]                    # 19
  - [-1, 1, C3k2, [128, False]]                  # 20

  # PAN: P2 → P3
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 1, C3k2, [256, False]]                  # 23

  # PAN: P3 → P4
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                  # 26

  # PAN: P4 → P5
  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]                  # 29

  # Detect P2, P3, P4, P5
  - [[20, 23, 26, 29], 1, Detect, [nc]]          # 30