# Ultralytics YOLO11 - No P2, CA only at backbone end + neck (fixed for scale='n')
nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0 → 16
  - [-1, 1, Conv, [128, 3, 2]]             # 1 → 32
  - [-1, 1, C3k2, [256, False, 0.25]]      # 2 → 64
  - [-1, 1, CoordAtt, [64, 64]]            # 3 ✅ input=64 → [64,64]
  - [-1, 1, Conv, [256, 3, 2]]             # 4 → 64
  - [-1, 1, C3k2, [512, False, 0.25]]      # 5 → 128
  - [-1, 1, Conv, [512, 3, 2]]             # 6 → 128
  - [-1, 1, C3k2, [512, False, 0.25]]      # 7 → 128
  - [-1, 1, Conv, [1024, 3, 2]]            # 8 → 256
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 9 → 256
  - [-1, 1, SPPF, [1024, 5]]               # 10 → 256
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 11 → 256

head:
  # FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 → 256
  - [[-1, 7], 1, Concat, [1]]                    # 13 → 256 + 128 = 384
  - [-1, 1, C3k2, [512, False, 0.25]]            # 14 → 128
  - [-1, 1, CoordAtt, [128, 128]]                # 15 ✅ input=128 → [128,128]

  # FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16 → 128
  - [[-1, 5], 1, Concat, [1]]                    # 17 → 128 + 128 = 256
  - [-1, 1, C3k2, [256, False, 0.25]]            # 18 → 64

  # PAN: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 19 → 64 → 128
  - [[-1, 15], 1, Concat, [1]]                   # 20 → 128 + 128 = 256
  - [-1, 1, C3k2, [512, False, 0.25]]            # 21 → 128

  # PAN: P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 22 → 128 → 256
  - [[-1, 11], 1, Concat, [1]]                   # 23 → 256 + 256 = 512
  - [-1, 1, C3k2, [1024, False, 0.25]]           # 24 → 256

  # Detect on P3, P4, P5 → NO P2
  - [[18, 21, 24], 1, Detect, [nc]]              # 25