# nc: 80  # number of classes, override by dataset.yaml
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
#   - [-1, 1, C3k2, [256, False, 0.25]]   # 2-lightweight replacement for C2f
#   - [-1, 1, CoordAtt, [256, 256]]       # 3 ✅ CA at P3 backbone
#   - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
#   - [-1, 1, C3k2, [512, False, 0.25]]   # 5
#   - [-1, 1, Conv, [512, 3, 2]]          # 6-P4/16
#   - [-1, 1, C3k2, [512, False, 0.25]]   # 7
#   - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32
#   - [-1, 1, C3k2, [1024, False, 0.25]]  # 9
#   - [-1, 1, SPPF, [1024, 5]]            # 10
#   - [-1, 1, C3k2, [1024, False, 0.25]]  # 11 final bottleneck
#   # Outputs: P2(3), P3(5), P4(7), P5(11)

# head:
#   # 🔹 FPN Top-down Path: P5 → P4 → P3
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12 Upsample P5
#   - [[-1, 7], 1, Concat, [1]]                     # 13 cat P4
#   - [-1, 1, C3k2, [512, False, 0.25]]             # 14
#   - [-1, 1, CoordAtt, [512, 512]]                 # 15 ✅ CA in neck (after P4 fusion)

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16 Upsample P4
#   - [[-1, 5], 1, Concat, [1]]                     # 17 cat P3
#   - [-1, 1, C3k2, [256, False, 0.25]]             # 18

#   # 🔹 High-Resolution P2 Head
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 19 Upsample P3 → P2
#   - [[-1, 1], 1, Concat, [1]]                     # 20 cat P2 backbone
#   - [-1, 1, C3k2, [128, False, 0.25]]             # 21 tiny head

#   # 🔹 PAN Bottom-up Path
#   - [-1, 1, Conv, [256, 3, 2]]                    # 22 Downsample P2→P3
#   - [[-1, 18], 1, Concat, [1]]                    # 23 cat P3 (Index '18' C3k2 P3 Top-down tetap)
#   - [-1, 1, C3k2, [256, False, 0.25]]             # 24 

#   - [-1, 1, Conv, [512, 3, 2]]                    # 25 Downsample P3→P4
#   - [[-1, 14], 1, Concat, [1]]                    # 26 cat P4 (Index '14' C3k2 P4 Top-down tetap)
#   - [-1, 1, C3k2, [512, False, 0.25]]             # 27 

#   - [-1, 1, Conv, [1024, 3, 2]]                   # 28 Downsample P4→P5
#   - [[-1, 11], 1, Concat, [1]]                    # 29 cat P5 backbone (Index '11' P5 backbone tetap)
#   - [-1, 1, C3k2, [1024, False, 0.25]]            # 30 

#   # 🔹 Detection Head (4 outputs)
#   - [[21, 24, 27, 30], 1, Detect, [nc]]           # 31 Detect(P2, P3, P4, P5)


# Ultralytics YOLO11 - No P2, CA only at backbone P3 + neck P4 (scale=n)
nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2 → 64 * 0.25 = 16
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4 → 128 * 0.25 = 32
  - [-1, 1, C3k2, [256, False, 0.25]]      # 2 → 256 * 0.25 = 64
  - [-1, 1, CoordAtt, [64, 64]]            # 3 ✅ CA at P3 (input = 64)
  - [-1, 1, Conv, [256, 3, 2]]             # 4-P3/8 → 64
  - [-1, 1, C3k2, [512, False, 0.25]]      # 5 → 512 * 0.25 = 128
  - [-1, 1, Conv, [512, 3, 2]]             # 6-P4/16 → 128
  - [-1, 1, C3k2, [512, False, 0.25]]      # 7 → 128
  - [-1, 1, Conv, [1024, 3, 2]]            # 8-P5/32 → 1024 * 0.25 = 256
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 9 → 256
  - [-1, 1, SPPF, [1024, 5]]               # 10 → 256
  - [-1, 1, C3k2, [1024, False, 0.25]]     # 11 → 256

head:
  # 🔹 FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 7], 1, Concat, [1]]                    # 13 (P4: 256 + 128)
  - [-1, 1, C3k2, [512, False, 0.25]]            # 14 → 128
  - [-1, 1, CoordAtt, [128, 128]]                # 15 ✅ CA in neck (P4 path)

  # 🔹 FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 5], 1, Concat, [1]]                    # 17 (P3: 128 + 128)
  - [-1, 1, C3k2, [256, False, 0.25]]            # 18 → 64

  # 🔹 PAN: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 19 (64 → 128)
  - [[-1, 15], 1, Concat, [1]]                   # 20 (128 + 128)
  - [-1, 1, C3k2, [512, False, 0.25]]            # 21 → 128

  # 🔹 PAN: P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 22 (128 → 256)
  - [[-1, 11], 1, Concat, [1]]                   # 23 (256 + 256)
  - [-1, 1, C3k2, [1024, False, 0.25]]           # 24 → 256

  # 🔹 Detection Head: ONLY P3, P4, P5 (NO P2)
  - [[18, 21, 24], 1, Detect, [nc]]              # 25 ← (P3=64, P4=128, P5=256)